In [3]:
from bs4 import BeautifulSoup
import requests

In [6]:
url = 'https://web.archive.org/web/20230908091635/https:/en.wikipedia.org/wiki/List_of_largest_banks'

In [7]:
page = requests.get(url)

In [8]:
soup = BeautifulSoup(page.text, 'html')

In [9]:
table = soup.find_all('table')[0]

In [10]:
bank_cap = table.find_all('th')

In [11]:
market_cap = [title.text.strip() for title in bank_cap]

print(market_cap)

['Rank', 'Bank name', 'Market cap(US$ billion)']

In [13]:
import pandas as pd

In [14]:
df = pd.DataFrame(columns = market_cap)
df

Empty DataFrame
Columns: [Rank, Bank name, Market cap(US$ billion)]
Index: []

In [15]:
column_data = table.find_all('tr')

In [16]:
for row in column_data[1:]:
    row_data = row.find_all('td')
    individual_row_data = [data.text.strip() for data in row_data]
    length = len(df)
    df.loc[length] = individual_row_data

In [17]:
df

  Rank                                Bank name Market cap(US$ billion)
0    1                           JPMorgan Chase                  432.92
1    2                          Bank of America                  231.52
2    3  Industrial and Commercial Bank of China                  194.56
3    4               Agricultural Bank of China                  160.68
4    5                                HDFC Bank                  157.91
5    6                              Wells Fargo                  155.87
6    7                        HSBC Holdings PLC                  148.90
7    8                           Morgan Stanley                  140.83
8    9                  China Construction Bank                  139.82
9   10                            Bank of China                  136.81

In [19]:
import numpy as np
import sqlite3
import matplotlib.pyplot as plt

In [20]:
df.fillna(0, inplace=True)
df

  Rank                                Bank name Market cap(US$ billion)
0    1                           JPMorgan Chase                  432.92
1    2                          Bank of America                  231.52
2    3  Industrial and Commercial Bank of China                  194.56
3    4               Agricultural Bank of China                  160.68
4    5                                HDFC Bank                  157.91
5    6                              Wells Fargo                  155.87
6    7                        HSBC Holdings PLC                  148.90
7    8                           Morgan Stanley                  140.83
8    9                  China Construction Bank                  139.82
9   10                            Bank of China                  136.81

In [21]:
df = df.set_index('Rank')
df

                                    Bank name Market cap(US$ billion)
Rank
1                              JPMorgan Chase                  432.92
2                             Bank of America                  231.52
3     Industrial and Commercial Bank of China                  194.56
4                  Agricultural Bank of China                  160.68
5                                   HDFC Bank                  157.91
6                                 Wells Fargo                  155.87
7                           HSBC Holdings PLC                  148.90
8                              Morgan Stanley                  140.83
9                     China Construction Bank                  139.82
10                              Bank of China                  136.81

In [22]:
import numpy as np

In [23]:
df.fillna(0, inplace=True)

In [37]:
exchange_rates = pd.read_csv(r"D:\Data Engineering\Project 1\exchange_rate.csv")
exchange_rates

  Currency   Rate  Unnamed: 2
0      EUR   0.93         NaN
1      GBP   0.80         NaN
2      INR  82.95         NaN

In [38]:
exchange_rates.drop(columns = ['Unnamed: 2'], inplace = True)
exchange_rates

  Currency   Rate
0      EUR   0.93
1      GBP   0.80
2      INR  82.95

In [39]:
df["Market cap(US$ billion)"] = pd.to_numeric(df["Market cap(US$ billion)"], errors='coerce')

In [41]:
df["Market cap(EUR billion)"] = df["Market cap(US$ billion)"] * exchange_rates["Rate"][0]

In [42]:
df["Market cap(GBP billion)"] = df["Market cap(US$ billion)"] * exchange_rates["Rate"][1]

In [43]:
df["Market cap(INR billion)"] = df["Market cap(US$ billion)"] * exchange_rates["Rate"][2]

In [44]:
df

,Bank name,Market cap(US$ billion),Market cap(EUR billion),Market cap(GBP billion),Market cap(INR billion)
Rank,,,,,
1,JPMorgan Chase,432.92,402.6156,346.336,35910.7140
2,Bank of America,231.52,215.3136,185.216,19204.5840
3,Industrial and Commercial Bank of China,194.56,180.9408,155.648,16138.7520
4,Agricultural Bank of China,160.68,149.4324,128.544,13328.4060
5,HDFC Bank,157.91,146.8563,126.328,13098.6345
6,Wells Fargo,155.87,144.9591,124.696,12929.4165
7,HSBC Holdings PLC,148.90,138.4770,119.120,12351.2550
8,Morgan Stanley,140.83,130.9719,112.664,11681.8485
9,China Construction Bank,139.82,130.0326,111.856,11598.0690
10,Bank of China,136.81,127.2333,109.448,11348.3895

In [46]:
df.to_csv(r'D:\Data Engineering\Project 1\ETL P1.csv')